TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/dsp/dsp_fpu_iir_filter_fpu64_f2838x.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2838x" --package "337bga" --part "F2838x_337bga" --context "CPU1" --product "C2000WARE@4.02.00.00"
 * @versions {"tool":"1.12.0+2406"}
 */

/**
 * Import the modules used in this configuration.
 */
const Filter  = scripting.addModule("/libraries/dsp/FPU/Filter/Filter.js", {}, false);
const Filter1 = Filter.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
Filter1.$name              = "myFILTER0";
Filter1.fpuType            = "FPU64";
Filter1.IIR.create(1);
Filter1.IIR[0].$name       = "myIIR0";
Filter1.IIR[0].coeffPtrA   = "denCoeffs";
Filter1.IIR[0].coeffPtrB   = "numCoeffs";
Filter1.IIR[0].dBuffPtr    = "delayBuff";
Filter1.IIR[0].inPtr       = "inBuff";
Filter1.IIR[0].outPtr      = "outBuff";
Filter1.IIR[0].scalePtr    = "scalePtr";
Filter1.IIR[0].filterOrder = 6;

const FPU   = scripting.addModule("/libraries/math/FPU/FPU.js", {}, false);
FPU.fpuType = "FPU64";
